classmates  = ['Michael', 'Sarah', 'Tracy', 'Bob', 'Jack'];

print(classmates [0:3]);#['Michael', 'Sarah', 'Tracy']
print(classmates [:3]);#['Michael', 'Sarah', 'Tracy']
print(classmates[-1:]);#['Jack']

L = list(range(30)); #[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
print(L);
print(L[:10]);# 取出前十个数[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(L[-10:]);# 取出后十个数[20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
print(L[-10:-1]);# 取出后十个到倒数第二个[20, 21, 22, 23, 24, 25, 26, 27, 28]
print(L[10:20]);# 取出第10-20个数 [20, 21, 22, 23, 24, 25, 26, 27, 28]
print(L[:10:2]);# 前十个数，每隔两个取一个 [0, 2, 4, 6, 8]
print(L[::5]); #所有数，每隔5个取一个[0, 5, 10, 15, 20, 25]
L2 = L[:]; #相当于复制List L 
print(L2);

#tuple 也支持切片操作，操作结果仍是tuple
T=(0,1,2,3,4,5,6,7,8,9);
print(T);
print(T[:3]);# 0,1,2

#字符串'xxx'也可以看成是一种list，每个元素就是一个字符。因此，字符串也可以用切片操作，只是操作结果仍是字符串
S = "ABCDEFG";
print(S); 
print(S[::2]);# ACEG
